[
  {
    "path": "posts/2021-12-02-impact-of-tree-canopy-cover-on-rate-of-deaths-per-positive-covid-19-case-in-california/",
    "title": "Impact of tree canopy cover on rate of deaths per positive COVID-19 case in California",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Clarissa Boyajian",
        "url": {}
      }
    ],
    "date": "2021-12-02",
    "categories": [],
    "contents": "\n\nContents\nResearch Question\nImportance\nData\nBasic Data Analysis\nBasic Data Visualization\nSimple Linear Regression\nConclusions and Future Analysis\nReferences\n\n\nResearch Question\nWhat impact does the percentage of tree canopy cover have on the rate of COVID deaths per confirmed positive case in California?\nThis blog post will conduct analysis at a county level within California to look at the impact of tree canopy cover percentages on the likelihood of dying after COVID-19 is contracted.\nImportance\nThis is an important and interesting environmental justice question to consider because tree canopy cover percentages and COVID-19 disproportionately impacted historically marginalized populations throughout the United States. Additionally, both are linked to respiratory and cardiovascular diseases. There is proven evidence that areas with more urban tree canopy have increased public health indicators (6). This includes lower rates of disease such as asthma, strokes, and cardiac disease. There is also evidence that individuals with existing respiratory and/or cardiovascular disease are not only more likely to contract COVID-19, but also more likely to be sicker or even die (8).\nData\nTree Canopy Data\nThe tree canopy data used for this analysis is publicly available from the Public Health Alliance of Southern California (2), which reports California Healthy Places Indexes. The data is available in CSV format, with a canopy cover percentage for each census tract within California. The website was last updated in April of 2021, but the tree canopy data is from 2011.\nCOVID-19 Data\nThe COVID-19 data used in this analysis was publicly available on the LA Times DataDesk GitHub repository (1). This data was collected using scrapers written in Python and Jupyter notebooks, scheduled and run via GitHub Actions, and archived using git. The scrapers collection data from the California Department of Public Health and other government agencies. This data is at a county-level spatial resolution and includes a daily number for both confirmed cases and deaths from February 1st, 2020 to today. The data used in this analysis included daily numbers from February 1st, 2020 through November 22, 2021. Potential bias in this data, is that confirmed cases are calculated based on positive test results. This means that any individuals who contracted COVID-19, but did not get tested, are not included in this data. Due to the high rate of asymptomatic cases (9), there is likely a large quantity of missing data.\nGeographic Data\nThe geographic data used in this analysis includes California county borders and U.S. Census regions, which subsets the state into 10 different regions. The county geographies were downloaded as a ShapeFile from the LA Times DataDesk GitHub repository (3). The U.S. Census regions were manually entered into R based on a map publicly available on the U.S. Census website (5).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBasic Data Analysis\nFor my analysis I planned to conduct a simple OLS linear regression, but first conducted some basic analysis to explore the data. To begin, I needed to transform the tree canopy and COVID-19 data to be at the same spatial and temporal resolution. First, I calculated the tree canopy cover percentage for each county using the group_by() and summarize() functions to create an average from the census tract data. Next, I calculated each county’s average population, average daily number of confirmed positive cases, and average daily reported deaths also using group_by() and summarize() functions. Finally, I calculated a rate of deaths per confirmed case and per capita for each county. Once this was completed, I combined all datasets based on the county Federal Information Processing System (FIPS) codes to create a dataframe including tree canopy, COVID-19, and income data as well as geometries for each county.\n\n\n\n\n\n\n\n\n\nBasic Data Visualization\nBefore deciding to use a simple OLS linear regression, I wanted to conduct some basic data visualization to explore the correlation between tree canopy and the rate of COVID-19 deaths per positive case.\nFirst, I aggregated the county data further into the 10 county regions as defined by the U.S. Census and plotted the canopy cover percentages and COVID-19 deaths per capita for each region (Fig 1). This exploration showed a potential relationship between lower canopied regions within California and COVID-19 deaths per capita.\n\n\n\n\n\n\n\n\n\n\n\n\nFigure 1: Plot showing the average tree canopy cover percentage and average daily COVID-19 death per capita for each of California’s 10 Census Regions.\n\n\n\nNext, I honed my exploration more closely in on my research questions: what impact does tree canopy coverage have on the likelihood that someone who contracts COVID-19 will die? To do this I created two maps. One map shows the average tree canopy cover percentage for each county within California (Fig 2). The other map displays the rate of average daily COVID-19 deaths per average daily confirmed positive cases for each county within California (Fig 2). As with my previous exploration this visualization does not show anything conclusively, but does indicate that there is a relationship between California counties with lower tree canopy cover and higher likelihood of death for individuals who contract COVID-19.\n\n\n\n\n\n\n\n\n\nFigure 2: Maps showing the average tree canopy cover percentage and average daily COVID-19 death per capita for each of the 57 California Counties. (Note: the tree canopy cover data used did not include Alpine County, so it was excluded from all analysis.)\n\n\n\nSimple Linear Regression\nI conducted a simple OLS linear regression to look at the impacts of tree canopy cover percentages on the rate of COVID-19 deaths per positive case. First, I used ggplot to create a scatter plot comparing the tree canopy cover percentage to the rate of COVID-19 deaths per positive case for each of the 57 California counties. Then I used geom_smooth() to plot a simple OLS linear regression of the data. Visually, it appears there is a negative correlation between the two rates (Fig 3).\n\n\n\nFigure 3: Correlation plot of tree canopy percentage compared vs. rate of COVID-19 death per positive case for 57 California Counties, including simple linear regression line.\n\n\n\n\n\n\nThe results of the OLS regression are shown in figure 4. The results show that there is in fact a negative correlation between tree canopy cover percentage and the rate of COVID-19 deaths per positive cases within California counties. The slope results indicates that for each 1% increase in tree canopy there is a 0.008% decrease in the COVID-19 death rate per positive case. However, the p-value is 0.11 meaning that there is no statistical significance that can be taken from this analysis. Additionally, the R-squared value is 0.05, meaning that only 5% of the variation in the rate of COVID-19 deaths per positive case are explained by average tree canopy cover percentages.\n\n\nTable 1: Simple Linear Regression Results: Impact of tree canopy cover on rate of COVID-19 deaths per positive case in California\n\n\nIntercept\n\n\nSlope\n\n\nP-value\n\n\nR-Squared\n\n\n0.0130365\n\n\n-0.0000772\n\n\n0.107893\n\n\n0.0463171\n\n\nHypothesis test\nBecause of the lack of statistical significance discussed above, we are unable to reject the null hypothesis with the current analysis.\nNull hypothesis: In California counties, the tree canopy cover percentage has no impact on the rate of COVID-19 deaths per positive reported case.Alternative hypothesis: In California counties, the tree canopy cover percentage has an impact on the rate of COVID-19 deaths per positive reported case.\nConfidence Interval\n\n\n\nI calculated a confidence interval and found that I was 95% confident that the true change in COVID-19 deaths per positive case for each 1% increase in tree canopy cover percentages was withing the range of (-0.000172, 0.000017).\nConclusions and Future Analysis\nAs discussed above, there is no statistically significant conclusion to be taken from this analysis. However, I believe that future analysis is warranted.\nFull United States\nThe analysis that I conducted only included 57 observations, one for each California county included in the original tree data. This is a low number of observations, so there may be a different result if analysis were conducted looking at all 3,006 counties within the United States.\nMedian Income\nOther future analysis would be to include median income in the regression model. Because those with higher median incomes generally live in communities with higher tree canopy cover percentages (7), it is possible that the negative correlation we saw was more not due to tree canopy. For future analysis I would use median income data from the United States Department of Agriculture (USDA) Economic Research Service website (4), which has 2019 median income data is aggregated to a county level.\nMore Recent Tree Data\nLastly, the data used in this analysis was from 2011. While tree canopy cover tends to change slowly, there have been technological advances in the last decade (such as LiDAR) that allow for more accurate tree canopy cover percentage estimates.\nReferences\nData\nLA Times DataDesk, California Coronavirus Scrapers GitHub repository: https://github.com/datadesk/california-coronavirus-scrapers\nPublic Health Alliance of Southern California’s California Healthy Places Index Report: https://healthyplacesindex.org/data-reports/\nLA Times DataDesk, Geographic Boundaries GitHub repository: https://github.com/datadesk/boundaries.latimes.com/blob/master/shapefiles/counties/2012/counties.prj\nUnited States Department of Agriculture Economic Research Service County-level Data Sets: https://www.ers.usda.gov/data-products/county-level-data-sets/\nUnited States Census, California Complete Count Office: https://census.ca.gov/regions/\nLiterature\nAstell-Burt, Thomas, and Xiaoqi Feng. “Urban Green Space, Tree Canopy, and Prevention of Heart Disease, Hypertension, and Diabetes: A Longitudinal Study.” The Lancet Planetary Health 3 (September 1, 2019): S16. https://doi.org/10.1016/S2542-5196(19)30159-7.\nSchwarz, Kirsten, Michail Fragkias, Christopher G. Boone, Weiqi Zhou, Melissa McHale, J. Morgan Grove, Jarlath O’Neil-Dunne, et al. “Trees Grow on Money: Urban Tree Canopy Cover and Environmental Justice.” PLOS ONE 10, no. 4 (April 1, 2015): e0122051. https://doi.org/10.1371/journal.pone.0122051.\nYang, Jing, Ya Zheng, Xi Gou, Ke Pu, Zhaofeng Chen, Qinghong Guo, Rui Ji, Haojia Wang, Yuping Wang, and Yongning Zhou. “Prevalence of Comorbidities and Its Effects in Patients Infected with SARS-CoV-2: A Systematic Review and Meta-Analysis.” International Journal of Infectious Diseases 94 (May 1, 2020): 91–95. https://doi.org/10.1016/j.ijid.2020.03.017.\nZhao, Hongjun, Xiaoxiao Lu, Yibin Deng, Yujin Tang, and Jiachun Lu. “COVID-19: Asymptomatic Carrier Transmission Is an Underestimated Problem.” Epidemiology & Infection 148 (ed 2020). https://doi.org/10.1017/S0950268820001235.\n\n\n\n",
    "preview": "posts/2021-12-02-impact-of-tree-canopy-cover-on-rate-of-deaths-per-positive-covid-19-case-in-california/impact-of-tree-canopy-cover-on-rate-of-deaths-per-positive-covid-19-case-in-california_files/figure-html5/unnamed-chunk-1-1.png",
    "last_modified": "2021-12-02T15:47:59-08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-19-baklava-recipe/",
    "title": "Baklava Recipe",
    "description": "Boyajian family baklava recipe",
    "author": [
      {
        "name": "Clarissa Boyajian",
        "url": {}
      }
    ],
    "date": "2021-08-19",
    "categories": [],
    "contents": "\nThis recipe is a compilation of online recipes created by my mom, Laurel Boyajian, in an attempt to recreate the baklava baked by her Armenian aunts from her childhood.\nRecipe modifications:  Vegan: you can easily make this recipe vegan by using a vegan butter - no other changes needed.  Sugar: you can cut down the total amount of sugar used to make a less sweet version or substitute honey instead of sugar.\nSupplies:\nRectangular baking dish\nFood processor\nPastry brush\nIngredients (filling, syrup, and dough):\nFilo dough (usually found in the frozen section of the grocery store near the pie crusts)\n6 Tbs rose water\n2 cups sugar\n3/4 cup water\n1 lb raw nuts (I use a combination of 50% walnut, 25% hazelnut, and 25% pistachio)\n1 1/3 - 2 cups butter (melted)\nSyrup Instructions:\nBoil together for 2 minutes 3/4 cup water and 1 1/2 cups sugar\nLet cool slightly (5-10 minutes)\nStir in 2 Tbsp rose water\nRefrigerate (NOTE: store in liquid measuring cup, if available, for later pouring ease)\nFilling Instructions:\nLet filo dough come to room temperature\nBlend together in short bursts all of the nuts and 1/2 cup sugar until finely chopped, transfer to bowl\nMix in 4 Tbsp rose water, gently folding rose water into nut and sugar mixture\nAssembly Instructions:\nPre-heat oven to 350\\(^\\circ\\)\nMelt 1 1/3 cups butter, transfer to small bowl\nIf necessary, cut filo dough in half to create sheets roughly the same size as your baking dish\nBrush bottom and sides of pan with melted butter\nLayer in 2 sheets of filo dough and brush with melted butter, repeating until roughly 1/3 of the dough has been used\nSpread half of the nut and sugar mixture into baking dish\nRepeat steps 8 and 9, using 1/3 of the remaining dough and all of the remaining nut and sugar mixture\nRepeat set 8, using all of the remaining dough (NOTE: you may need to re-melt your butter or melt additional butter throughout this process)\nBrush the top layer of the baklava with extra butter\nCut 1-inch wide strips along the diagonals to create diamond shaped pieces, ensuring knife cuts through bottom layer of dough\nBake for 30 minutes at 350\\(^\\circ\\)\nReduce hear to 300\\(^\\circ\\) and bake for 10 minutes or until top is golden brown\nRemove from oven and immediately re-cut along both diagonals (ensure cut goes all the way through the bottom layers)\nPour all of syrup evenly over the whole dish (it will look syrupy)\nLet cool at room temperature for 3 hours to allow syrup to completely absorb\nENJOY!\n\n\n\n",
    "preview": {},
    "last_modified": "2021-10-19T19:52:49-07:00",
    "input_file": {}
  }
]
