[
  {
    "path": "posts/2021-08-19-baklava-recipe/",
    "title": "Baklava Recipe",
    "description": "Boyajian family baklava recipe",
    "author": [
      {
        "name": "Clarissa Boyajian",
        "url": {}
      }
    ],
    "date": "2021-08-19",
    "categories": [],
    "contents": "\nThis recipe is a compilation of online recipes created by my mom, Laurel Boyajian, in an attempt to recreate the baklava baked by her Armenian aunts from her childhood.\nRecipe modifications:  Vegan: you can easily make this recipe vegan by using a vegan butter - no other changes needed.  Sugar: you can cut down the total amount of sugar used to make a less sweet version or substitute honey instead of sugar.\nSupplies:\nRectangular baking dish\nFood processor\nPastry brush\nIngredients (filling, syrup, and dough):\nFilo dough (usually found in the frozen section of the grocery store near the pie crusts)\n6 Tbs rose water\n2 cups sugar\n3/4 cup water\n1 lb raw nuts (I use a combination of 50% walnut, 25% hazelnut, and 25% pistachio)\n1 1/3 - 2 cups butter (melted)\nSyrup Instructions:\nBoil together for 2 minutes 3/4 cup water and 1 1/2 cups sugar\nLet cool slightly (5-10 minutes)\nStir in 2 Tbsp rose water\nRefrigerate (NOTE: store in liquid measuring cup, if available, for later pouring ease)\nFilling Instructions:\nLet filo dough come to room temperature\nBlend together in short bursts all of the nuts and 1/2 cup sugar until finely chopped, transfer to bowl\nMix in 4 Tbsp rose water, gently folding rose water into nut and sugar mixture\nAssembly Instructions:\nPre-heat oven to 350\\(^\\circ\\)\nMelt 1 1/3 cups butter, transfer to small bowl\nIf necessary, cut filo dough in half to create sheets roughly the same size as your baking dish\nBrush bottom and sides of pan with melted butter\nLayer in 2 sheets of filo dough and brush with melted butter, repeating until roughly 1/3 of the dough has been used\nSpread half of the nut and sugar mixture into baking dish\nRepeat steps 8 and 9, using 1/3 of the remaining dough and all of the remaining nut and sugar mixture\nRepeat set 8, using all of the remaining dough (NOTE: you may need to re-melt your butter or melt additional butter throughout this process)\nBrush the top layer of the baklava with extra butter\nCut 1-inch wide strips along the diagonals to create diamond shaped pieces, ensuring knife cuts through bottom layer of dough\nBake for 30 minutes at 350\\(^\\circ\\)\nReduce hear to 300\\(^\\circ\\) and bake for 10 minutes or until top is golden brown\nRemove from oven and immediately re-cut along both diagonals (ensure cut goes all the way through the bottom layers)\nPour all of syrup evenly over the whole dish (it will look syrupy)\nLet cool at room temperature for 3 hours to allow syrup to completely absorb\nENJOY!\n\n\n\n",
    "preview": {},
    "last_modified": "2021-10-19T19:52:49-07:00",
    "input_file": {}
  }
]
